app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Asdfasd"], ["description", "asdfasdfasdf"], ["author_id", 1], ["created_at", "2016-02-01 05:49:17.037502"], ["updated_at", "2016-02-01 05:49:17.037502"]]
---
  def create
    @post = Post.new(author_id: params[:author_id])
    @post.save